{
    "id": 10,
    "title": "المعرض الشخصي الحديث",
    "subtitle": "معرض مطوّر متعدد اللغات بهندسة Next.js الحديثة",
    "isFeatured": true,
    "description": "بنية معرض مطوّر حديثة، متعددة اللغات وعالية الأداء. تجمع بين عرض الهوية الشخصية بتصميم جمالي، وهندسة معيارية، وهيكلية قابلة للتوسّع.",
    "longDescription": "المعرض الشخصي الحديث هو بنية معرض متعددة اللغات وقابلة للتوسّع، تم تصميمها لتمكين المطوّرين من عرض مشاريعهم ومهاراتهم وخبراتهم التقنية بشكل احترافي.\n\nالمشروع ليس مجرد عرض بصري، بل هو نتيجة عملية مدروسة لاتخاذ قرارات معمارية منظمة. تم بناؤه باستخدام هندسة Next.js App Router ليقدّم نظامًا سريعًا، محسّنًا لمحركات البحث، وموجّهًا للأداء. وبفضل هيكلية التوجيه الديناميكي، يمكن إدارة المشاريع عبر صفحات تفاصيل مخصّصة.\n\nمن خلال دعم تعدد اللغات (i18n)، يتم تنظيم المحتوى ضمن هيكلية متعددة اللغات. يمكن إدارة جميع النصوص مركزيًا، كما يمكن دمج لغات جديدة بسهولة داخل النظام.\n\nوبفضل هندسة المكونات المعيارية، يمكن تطوير كل قسم بشكل مستقل وإعادة استخدامه. يضمن هذا النهج استدامة المشروع سواء للاستخدام الشخصي أو لتحويله إلى منتج (مثل بيعه كقالب).\n\nعلى مستوى التصميم، تم التركيز على البساطة، وتوازن الطباعة، والحركات الانسيابية. الهدف هو تقديم تجربة نظيفة، احترافية، وملهمة بالثقة للزوار.",
    "category": "تطبيق ويب",
    "tags": [
        "Next.js",
        "TypeScript",
        "JSON",
        "Tailwind CSS",
        "متعدد اللغات",
        "UI/UX",
        "App Router"
    ],
    "image": "https://res.cloudinary.com/dvx6nsrd9/image/upload/v1770994912/portfolio_qeqmgo.png",
    "techLogos": [
        "nextjs",
        "tailwind",
        "json",
        "typescript"
    ],
    "date": "2025-11",
    "duration": "شهر واحد",
    "teamSize": 1,
    "role": "مطوّر Full Stack",
    "demoLink": "https://yasiralrawi.netlify.app/ar",
    "githubLink": "https://github.com/yasir237/modern-portfolio-ar",
    "buy": {
        "price": "16$",
        "currency": "USD",
        "features": [
            "تحكم كامل بمدى الحياة",
            "اتاحة جميع المميزات",
            "تسليم الكود المصدري"
        ],
        "buylink": "https://yasiralrawi.gumroad.com/l/psuwo"
    },
    "technologies": [
        {
            "name": "Next.js (App Router)",
            "description": "هيكل حديث لإطار React يتميز بملاءمته لمحركات البحث، وأداء عالٍ، ودعم معمارية مكونات الخادم والعميل."
        },
        {
            "name": "تعدد اللغات (i18n)",
            "description": "دعم متعدد اللغات قائم على التوجيه الديناميكي. يمكن إدارة المحتوى مركزيًا عبر ملفات الرسائل."
        },
        {
            "name": "الهندسة المعيارية للمكونات",
            "description": "يتم تصميم كل قسم كمكوّن مستقل وقابل لإعادة الاستخدام، مما يوفّر هيكلية قابلة للتوسّع ومستدامة."
        },
        {
            "name": "Tailwind CSS",
            "description": "منهجية Utility-first تتيح تطويرًا سريعًا، ونظام تصميم متناسق، وبنية متجاوبة."
        },
        {
            "name": "إدارة المشاريع الديناميكية",
            "description": "يمكن عرض كل مشروع عبر مسار خاص به. إدارة محتوى سهلة بفضل بنية بيانات قائمة على JSON."
        }
    ],
    "contentBlocks": [
        {
            "type": 0,
            "heading": "نظرة عامة على المشروع",
            "subheading": "بنية معرض متعددة اللغات، موجّهة للأداء وقابلة للتوسّع",
            "content": "المعرض الشخصي الحديث هو تطبيق ويب حديث يتيح للمطورين عرض خبراتهم التقنية ومشاريعهم ضمن إطار احترافي.\n\nيوفر النظام تنظيمًا قويًا للمحتوى من خلال دعم تعدد اللغات، وصفحات تفاصيل المشاريع الديناميكية، وهندسة مكونات معيارية. وبفضل هيكليته المحسّنة لمحركات البحث وتحسينات الأداء، يضمن سرعة تحميل عالية وتوافقًا ممتازًا مع محركات البحث.\n\nتم تصميم المشروع ليخدم عرض الهوية الشخصية وكذلك لتحويله إلى منتج قابل للبيع كقالب."
        },
        {
            "type": 0,
            "heading": "الهندسة الحديثة متعددة اللغات",
            "subheading": "تصميم نظام متعدد اللغات وقابل للتوسّع",
            "content": "هذا المعرض ليس مجرد عرض بصري، بل يعتمد على هندسة معيارية قائمة على البيانات وموجّهة للأداء.\n\nتوجد ملفات محتوى مستقلة لكل لغة. وعند تغيير اللغة، يقوم النظام بتحميل ملف اللغة المقابل تلقائيًا.\n\nلإضافة لغة جديدة، يكفي إنشاء ملف محتوى جديد."
        },
        {
            "type": 0,
            "heading": "إدارة المشاريع المعتمدة على JSON",
            "subheading": "مشاريع غير محدودة • إدارة محتوى دون تعديل الكود",
            "content": "يتم إضافة كل مشروع كملف JSON مستقل.\n\nلا يوجد حد لعدد الملفات، وبالتالي يدعم النظام عددًا غير محدود من المشاريع.\n\nلإضافة مشروع جديد، يكفي إنشاء ملف JSON جديد دون الحاجة لتعديل البنية الحالية.\n\nهذا النهج يجعل إدارة المشروع ممكنة دون الحاجة لخبرة تقنية متقدمة."
        },
        {
            "type": 0,
            "heading": "التوجيه الديناميكي وبنية محسّنة لمحركات البحث",
            "subheading": "صفحة تفاصيل مخصّصة لكل مشروع",
            "content": "بفضل هيكلية التوجيه الديناميكي، يتم عرض كل مشروع عبر رابط فريد خاص به.\n\nتُنشئ هذه المعمارية صفحات مستقلة محسّنة لمحركات البحث.\n\nتم استخدام هندسة Next.js App Router الحديثة لضمان أفضل تجربة مستخدم وأداء SEO."
        },
        {
            "type": 0,
            "heading": "الهندسة المعيارية للمكونات",
            "subheading": "هيكلية قابلة لإعادة الاستخدام ومستدامة",
            "content": "تم تصميم جميع الأقسام كمكونات مستقلة وقابلة لإعادة الاستخدام.\n\nتسمح هذه البنية بتوسيع النظام بسهولة، وإضافة أقسام جديدة، وتحسين التصميم الحالي دون أي تعارض.\n\nتم تنظيم الكود بعناية ليكون نظيفًا، قابلًا للتوسّع، ومستدامًا."
        },
        {
            "type": 0,
            "heading": "الأداء وتجربة المستخدم",
            "subheading": "سريع، انسيابي، وحديث",
            "content": "يتم تقديم تجربة مستخدم احترافية من خلال اعتماد أسلوب تصميم بسيط وحركات سلسة.\n\nوبفضل البنية المتجاوبة، يتم الحفاظ على مظهر متناسق عبر جميع الأجهزة.\n\nالهدف هو خلق انطباع رقمي نظيف، موثوق، ومؤثر."
        },
        {
            "type": 0,
            "heading": "نظام محتوى قائم على كتل JSON",
            "subheading": "بنية ديناميكية وقابلة للتوسّع",
            "content": "يتم إضافة كل مشروع كملف JSON مستقل. ويوضع المحتوى ضمن مصفوفة 'contentBlocks'، حيث يتم تعريف كل كتلة بقيمة 'type' محددة.\n\nيقوم النظام تلقائيًا بعرض المكوّن المناسب بناءً على نوع الكتلة، مما يتيح إدارة مرنة للنصوص، الصور، الفيديوهات، المعارض، ومحتويات الأكواد المتعددة."
        },
        {
            "type": 0,
            "heading": "مزايا النظام",
            "content": "لإضافة مشروع جديد، يكفي إنشاء ملف JSON جديد دون الحاجة لإجراء أي تعديل على قاعدة الكود.\n\nتوجد ملفات محتوى مستقلة لكل لغة. وعند تغيير اللغة، يقوم النظام بتحميل الملف المقابل تلقائيًا.\n\nتجعل هذه المعمارية المعرض قابلاً للتوسّع بلا حدود، وسهل الإدارة، ومناسبًا للتحويل إلى منتج."
        },
        {
            "type": 0,
            "heading": "الكود المصدري والتوثيق",
            "subheading": "دليل التثبيت، المعمارية، وطريقة الاستخدام",
            "content": "يمكنك الوصول إلى الكود المصدري الكامل، والبنية المعمارية، وخطوات التثبيت، والتوثيق الشامل عبر مستودع GitHub.\n\nتم شرح جميع تفاصيل الاستخدام والتوثيق داخل ملف README.\n\nالمستودع: https://github.com/yasir237/modern-portfolio-ar"
        }
    ]
}